set_property PACKAGE_PIN W2 [get_ports super_pixel_sel]
set_property PACKAGE_PIN V2 [get_ports config_clk]
set_property PACKAGE_PIN W1 [get_ports reset_not]
set_property PACKAGE_PIN Y2 [get_ports config_in]
set_property PACKAGE_PIN V1 [get_ports config_load]
set_property PACKAGE_PIN Y1 [get_ports config_out]
set_property PACKAGE_PIN Y4 [get_ports bxclk_ana]
set_property PACKAGE_PIN AB4 [get_ports bxclk]
set_property PACKAGE_PIN Y3 [get_ports vin_test_trig_out]
set_property PACKAGE_PIN AC3 [get_ports scan_in]
set_property PACKAGE_PIN AB3 [get_ports scan_load]
set_property PACKAGE_PIN AC1 [get_ports scan_out]
set_property PACKAGE_PIN V4 [get_ports dnn_output_0]
set_property PACKAGE_PIN V3 [get_ports dnn_output_1]
set_property PACKAGE_PIN P10 [get_ports dn_event_toggle]

set_property IOSTANDARD LVCMOS18 [get_ports super_pixel_sel]
set_property IOSTANDARD LVCMOS18 [get_ports config_clk]
set_property IOSTANDARD LVCMOS18 [get_ports reset_not]
set_property IOSTANDARD LVCMOS18 [get_ports config_in]
set_property IOSTANDARD LVCMOS18 [get_ports config_load]
set_property IOSTANDARD LVCMOS18 [get_ports config_out]
set_property IOSTANDARD LVCMOS18 [get_ports bxclk_ana]
set_property IOSTANDARD LVCMOS18 [get_ports bxclk]
set_property IOSTANDARD LVCMOS18 [get_ports vin_test_trig_out]
set_property IOSTANDARD LVCMOS18 [get_ports scan_in]
set_property IOSTANDARD LVCMOS18 [get_ports scan_load]
set_property IOSTANDARD LVCMOS18 [get_ports scan_out]
set_property IOSTANDARD LVCMOS18 [get_ports dnn_output_0]
set_property IOSTANDARD LVCMOS18 [get_ports dnn_output_1]
set_property IOSTANDARD LVCMOS18 [get_ports dn_event_toggle]

#set_input_delay -clock [get_clocks clk_pl_1] -min -add_delay 0.200 [get_ports scan_out]
#set_input_delay -clock [get_clocks clk_pl_1] -max -add_delay 0.200 [get_ports scan_out]
#set_output_delay -clock [get_clocks clk_pl_1] -min -add_delay 0.000 [get_ports bxclk]
#set_output_delay -clock [get_clocks clk_pl_1] -max -add_delay 0.200 [get_ports bxclk]
#set_output_delay -clock [get_clocks clk_pl_1] -min -add_delay 0.000 [get_ports bxclk_ana]
#set_output_delay -clock [get_clocks clk_pl_1] -max -add_delay 0.200 [get_ports bxclk_ana]
#set_output_delay -clock [get_clocks clk_pl_1] -min -add_delay 0.000 [get_ports reset_not]
#set_output_delay -clock [get_clocks clk_pl_1] -max -add_delay 0.200 [get_ports reset_not]
#set_output_delay -clock [get_clocks clk_pl_1] -min -add_delay 0.000 [get_ports scan_in]
#set_output_delay -clock [get_clocks clk_pl_1] -max -add_delay 0.200 [get_ports scan_in]
#set_output_delay -clock [get_clocks clk_pl_1] -min -add_delay 0.000 [get_ports scan_load]
#set_output_delay -clock [get_clocks clk_pl_1] -max -add_delay 0.200 [get_ports scan_load]
#set_output_delay -clock [get_clocks clk_pl_1] -min -add_delay 0.000 [get_ports super_pixel_sel]
#set_output_delay -clock [get_clocks clk_pl_1] -max -add_delay 0.200 [get_ports super_pixel_sel]

#set_property ASYNC_REG true [get_cells cms_pix_28_fw_top_bd_i/fw_top_v_0/inst/fw_top_inst/fw_ipx_wrap_inst/fw_ip2_inst/fw_bxclk_ana_ff_reg]
#set_property ASYNC_REG true [get_cells cms_pix_28_fw_top_bd_i/fw_top_v_0/inst/fw_top_inst/fw_ipx_wrap_inst/com_fw_to_dut_inst/bxclk_ana_iob_reg]
#set_property ASYNC_REG true [get_cells cms_pix_28_fw_top_bd_i/fw_top_v_0/inst/fw_top_inst/fw_ipx_wrap_inst/fw_ip2_inst/fw_super_pixel_sel_ff_reg]
#set_property ASYNC_REG true [get_cells cms_pix_28_fw_top_bd_i/fw_top_v_0/inst/fw_top_inst/fw_ipx_wrap_inst/com_fw_to_dut_inst/super_pixel_sel_iob_reg]
#set_property ASYNC_REG true [get_cells cms_pix_28_fw_top_bd_i/fw_top_v_0/inst/fw_top_inst/fw_ipx_wrap_inst/fw_ip2_inst/fw_bxclk_ff_reg]
#set_property ASYNC_REG true [get_cells cms_pix_28_fw_top_bd_i/fw_top_v_0/inst/fw_top_inst/fw_ipx_wrap_inst/com_fw_to_dut_inst/bxclk_iob_reg]
#set_clock_groups -asynchronous -group [get_clocks clk_pl_1] -group [get_clocks clk_pl_0]
#set_clock_groups -asynchronous -group [get_clocks clk_pl_0] -group [get_clocks clk_pl_1]
#[Vivado 12-4739] set_clock_groups:No valid object(s) found for '-group '
